conformance/mutants/integration/issue49-data-cursor-monotonic-acknowledgement.patch
diff --git a/extensions/synchro-pg/src/pull.rs b/extensions/synchro-pg/src/pull.rs
--- a/extensions/synchro-pg/src/pull.rs
+++ b/extensions/synchro-pg/src/pull.rs
@@ -500,7 +500,7 @@ fn acknowledge_scope_positions(
         } else {
             StreamPosition::GenerationStart
         };
-        if presented <= &stored {
+        if presented == &stored {
             continue;
         }
