conformance/mutants/integration/issue49-security-adapter-boundary.patch
diff --git a/api/go/handlers.go b/api/go/handlers.go
index 46e6a59..b5e2b7f 100644
--- a/api/go/handlers.go
+++ b/api/go/handlers.go
@@ -75,7 +75,7 @@ func (h *Handler) servePull(w http.ResponseWriter, r *http.Request) {
 		return
 	}
 
-	raw, members, ok := decodeJSONBodyObject(w, r, pullRequestMembers...)
+	_, members, ok := decodeJSONBodyObject(w, r, pullRequestMembers...)
 	if !ok {
 		return
 	}
@@ -83,12 +83,8 @@ func (h *Handler) servePull(w http.ResponseWriter, r *http.Request) {
 	if !requireStringMember(w, members, "client_id") {
 		return
 	}
-	resp, err := h.queryJSONB(
-		r.Context(),
-		"SELECT synchro.synchro_pull($1, $2::pg_catalog.jsonb)",
-		userID,
-		string(raw),
-	)
+	// Mutant: the adapter fabricates a semantic pull result without the extension.
+	resp, err := []byte(`{"changes":[],"has_more":false,"scope_cursors":{}}`), error(nil)
 	if err != nil {
 		mapSQLError(w, err)
 		return
