conformance/mutants/integration/issue49-security-health-aggregation.patch
diff --git a/extensions/synchro-pg/src/health.rs b/extensions/synchro-pg/src/health.rs
--- a/extensions/synchro-pg/src/health.rs
+++ b/extensions/synchro-pg/src/health.rs
@@ -648,7 +648,8 @@ impl ReadinessStatus {
     pub(crate) fn ready(&self) -> bool {
         self.checks
             .values()
-            .all(|check| check.state == CheckState::Ok)
+            // Mutant: one healthy check makes the whole database ready.
+            .any(|check| check.state == CheckState::Ok)
     }
 
     pub(crate) fn detail(&self) -> serde_json::Value {
