conformance/mutants/integration/issue49-security-public-authority.patch
diff --git a/extensions/synchro-pg/src/lib.rs b/extensions/synchro-pg/src/lib.rs
--- a/extensions/synchro-pg/src/lib.rs
+++ b/extensions/synchro-pg/src/lib.rs
@@ -2023,6 +2023,8 @@ REVOKE ALL ON ALL TABLES IN SCHEMA synchro FROM PUBLIC;
 REVOKE ALL ON ALL SEQUENCES IN SCHEMA synchro FROM PUBLIC;
 REVOKE EXECUTE ON ALL FUNCTIONS IN SCHEMA synchro FROM PUBLIC;
 REVOKE USAGE ON TYPE synchro.synchro_row_ref FROM PUBLIC;
+-- Mutant: expose one extension-owned type through PUBLIC.
+GRANT USAGE ON TYPE synchro.synchro_row_ref TO PUBLIC;
 
 GRANT USAGE ON SCHEMA synchro
     TO synchro_adapter, synchro_seed, synchro_monitor, synchro_operator, synchro_worker;
