conformance/mutants/integration/issue49-security-registry-key-update.patch
diff --git a/extensions/synchro-pg/src/lib.rs b/extensions/synchro-pg/src/lib.rs
--- a/extensions/synchro-pg/src/lib.rs
+++ b/extensions/synchro-pg/src/lib.rs
@@ -1693,10 +1693,7 @@ SECURITY DEFINER
 SET search_path = pg_catalog, synchro
 AS $$
 BEGIN
-    IF to_jsonb(OLD) -> TG_ARGV[0] IS DISTINCT FROM to_jsonb(NEW) -> TG_ARGV[0] THEN
-        RAISE EXCEPTION 'registered primary key cannot change'
-            USING ERRCODE = '23514';
-    END IF;
+    -- Mutant: permit a registered primary-key value update.
     RETURN NEW;
 END;
 $$;
