conformance/mutants/integration/issue49-remaining-atomic-push.patch
diff --git a/extensions/synchro-pg/src/push.rs b/extensions/synchro-pg/src/push.rs
--- a/extensions/synchro-pg/src/push.rs
+++ b/extensions/synchro-pg/src/push.rs
@@ -416,7 +416,11 @@ fn synchro_push_contract(p_user_id: &str, p_request: pgrx::JsonB) -> String {
         let response_bytes = canonical_push_response_bytes(&response)
             .unwrap_or_else(|_| pgrx::error!("canonicalizing push response failed"));
         if response_bytes.len() > MAX_PUSH_REQUEST_BYTES {
-            pgrx::error!("push response exceeds the configured byte limit")
+            return push_protocol_error(
+                ProtocolErrorCode::SyncIntegrityFailure,
+                "push response exceeds the configured byte limit",
+                false,
+            );
         }
 
         let mut mutation_ledgers = Vec::new();
