conformance/mutants/integration/issue49-remaining-client-time.patch
diff --git a/extensions/synchro-pg/src/push.rs b/extensions/synchro-pg/src/push.rs
--- a/extensions/synchro-pg/src/push.rs
+++ b/extensions/synchro-pg/src/push.rs
@@ -2378,7 +2378,7 @@ fn push_update(
         .collect::<Vec<_>>();
     if table_reg.has_updated_at {
         assignments.push(format!(
-            "{} = now()",
+            "{} = '2099-12-31T23:59:59.999999Z'::timestamptz",
             pg_quote_ident(&table_reg.updated_at_col)
         ));
     }
