conformance/mutants/integration/issue49-remaining-portable-integer.patch
diff --git a/extensions/synchro-pg/src/lib.rs b/extensions/synchro-pg/src/lib.rs
--- a/extensions/synchro-pg/src/lib.rs
+++ b/extensions/synchro-pg/src/lib.rs
@@ -416,6 +416,6 @@ extension_sql!(
     updated_at TIMESTAMPTZ NOT NULL DEFAULT now(),
     UNIQUE (user_id, client_id),
-    CHECK (scope_set_version > 0 AND scope_set_version <= 9007199254740991),
+    CHECK (scope_set_version > 0),
     CHECK (client_generation > 0 AND client_generation <= 9007199254740991),
     CHECK (accepted_write_epoch > 0 AND accepted_write_epoch <= 9007199254740991),
     CHECK (generation_expires_at IS NULL OR generation_expires_at >= generation_created_at),
