conformance/mutants/integration/issue49-remaining-seed-transaction.patch
diff --git a/extensions/synchro-pg/src/portable_seed.rs b/extensions/synchro-pg/src/portable_seed.rs
--- a/extensions/synchro-pg/src/portable_seed.rs
+++ b/extensions/synchro-pg/src/portable_seed.rs
@@ -707,7 +707,8 @@ fn verify_export_transaction(client: &SpiClient<'_>) -> Result<(), String> {
     let isolation = required_text(&row, "isolation", "")?;
     let read_only = required_text(&row, "read_only", "")?;
     let deferrable = required_text(&row, "deferrable", "")?;
-    if isolation != "serializable" || read_only != "on" || deferrable != "on" {
+    if (isolation != "serializable" || read_only != "on" || deferrable != "on") && false
+    {
         return Err("portable seed requires SERIALIZABLE READ ONLY DEFERRABLE".to_string());
     }
     Ok(())
