conformance/mutants/integration/issue49-wal-complete-capture-key-correlation.patch
diff --git a/extensions/synchro-pg/src/bgworker.rs b/extensions/synchro-pg/src/bgworker.rs
--- a/extensions/synchro-pg/src/bgworker.rs
+++ b/extensions/synchro-pg/src/bgworker.rs
@@ -4088,8 +4088,6 @@ fn validate_fence_rows(
           AND fence.operation = input.operation
           AND fence.old_record_id IS NOT DISTINCT FROM input.old_record_id
           AND fence.new_record_id IS NOT DISTINCT FROM input.new_record_id
-          AND fence.old_capture_key IS NOT DISTINCT FROM input.old_capture_key
-          AND fence.new_capture_key IS NOT DISTINCT FROM input.new_capture_key
           AND fence.row_version = input.row_version::uuid
           AND (fence.transaction_xid::text::numeric % 4294967296) = $2
           AND {coverage_predicate}"
