conformance/mutants/integration/issue49-wal-key-version-correlation.patch
diff --git a/extensions/synchro-pg/src/bgworker.rs b/extensions/synchro-pg/src/bgworker.rs
--- a/extensions/synchro-pg/src/bgworker.rs
+++ b/extensions/synchro-pg/src/bgworker.rs
@@ -3901,11 +3901,6 @@ fn validate_fence_row(
             AND fence.physical_relation = $7
             AND fence.physical_relation_oid = $8::oid
             AND fence.operation = $9
-            AND fence.old_record_id IS NOT DISTINCT FROM $10
-            AND fence.new_record_id IS NOT DISTINCT FROM $11
-            AND fence.old_capture_key IS NOT DISTINCT FROM $12
-            AND fence.new_capture_key IS NOT DISTINCT FROM $13
-            AND fence.row_version = $14::uuid
             AND (fence.transaction_xid::text::numeric % 4294967296) = $15
             AND {coverage_predicate}"
     );
