conformance/mutants/integration/progress-order.patch
diff --git a/extensions/synchro-pg/src/bgworker.rs b/extensions/synchro-pg/src/bgworker.rs
--- a/extensions/synchro-pg/src/bgworker.rs
+++ b/extensions/synchro-pg/src/bgworker.rs
@@ -3572,8 +3572,6 @@ fn validate_progress_order(
         return Err(failure("activation_barrier", transaction.commit_lsn));
     }
     if progress_stream != stream_generation
-        || prior_commit.is_some_and(|value| value >= transaction.commit_lsn)
-        || prior_end.is_some_and(|value| value >= transaction.end_lsn)
     {
         return Err(failure("validation_failed", transaction.commit_lsn));
     }
